---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeError
source: html/ddc05c68-6eaf-2e63-9000-e346562189b2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeError Property

You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.

## Syntax (C#)
```csharp
public static FailureDefinitionId AttemptToConnectNonSlopingElementToSlopedPipeError { get; }
```